mrdunk/esp8266_mqtt_kitchensink/src/http_server.cpp
  // The following tags work inside lists.
  if(strstr(list_parent, "|io.entry")){
    int parent_depth = depthOfParent(list_parent, "|io.entry");

    // Not every config->devices entry is populated.
    int index = config->labelToIndex(list_element[parent_depth]);

    if(strcmp(tag, "index") == 0){
      String(index).toCharArray(destination, len);
      element_count = index > 0;
    } else if(strcmp(tag, "topic") == 0){
      DeviceAddress(config->devices[index]).toCharArray(destination, len);
      element_count = strlen(destination) > 0;
    } else if(strcmp(tag, "default") == 0){
      String(config->devices[index].io_default).toCharArray(destination, len);
      element_count = strlen(destination) > 0;
    } else if(strcmp(tag, "inverted") == 0){
      String(config->devices[index].inverted ? "Y":"N").toCharArray(destination, len);
      element_count = config->devices[index].inverted;
    }
  }

  if(strstr(list_parent, "|iotype")){
    int parent_depth = depthOfParent(list_parent, "|iotype");
    char values[][12] = {"test", "onoff", "pwm", "inputpullup", "input", "timer"};
    
    if(strcmp(tag, "value") == 0){
      element_count = list_element[list_depth] > 0;
      String(values[list_element[list_depth]]).toCharArray(destination, len);
    } else if(strcmp(tag, "selected") == 0){
      int context_depth = depthOfParent(list_parent, "|io.entry");
      Io_Type selected_value = config->devices[list_element[context_depth]].io_type;

      String(values[selected_value]).toCharArray(destination, len);
      // XXX Is it ok to compare int with Io_Type ?
      element_count = (list_element[parent_depth] == selected_value);
    }
  }

  if(strstr(list_parent, "|iopin")){
    int parent_depth = depthOfParent(list_parent, "|iopin");
    int values[] = {0,1,2,3,4,5,12,13,14,15,16};  // Valid output pins.
    
    if(strcmp(tag, "value") == 0){
      element_count = list_element[list_depth] > 0;
      String(values[list_element[list_depth]]).toCharArray(destination, len);
    } else if(strcmp(tag, "selected") == 0){
      // iopin can be used from more than one context.
      // We need to determine which context and calculate the selected value
      // based on that.
      // TODO: It would be preferable to pass in a value somehow.

      int selected_value = 0;
      if(strstr(list_parent, "|io.entry")){
        // Within the {{#io.entry} context.
        int context_depth = depthOfParent(list_parent, "|io.entry");
        selected_value = config->devices[list_element[context_depth]].iopin;
      } else {
        // Otherwise it's probably the enableiopin context.
        selected_value = config->enableiopin;
      }

      String(selected_value).toCharArray(destination, len);
      element_count = (values[list_element[parent_depth]] == selected_value);
    }
  }

  if(strstr(list_parent, "|host.ssids")){
    if(strcmp(tag, "name") == 0){
      WiFi.SSID(list_element[list_depth]).toCharArray(destination, len);
    } else if(strcmp(tag, "signal") == 0){
      String(WiFi.RSSI(list_element[list_depth])).toCharArray(destination, len);
    }
  }

  if(strstr(list_parent, "|fs.files")){
    int parent_depth = depthOfParent(list_parent, "|fs.files");

    Dir dir = SPIFFS.openDir("/");
    for(int i=0; i <= list_element[parent_depth] && dir.next(); i++){ }

    if(strcmp(tag, "filename") == 0){
      if(type == tagPlain){
        File file = dir.openFile("r");
        String filename = file.name();
        filename.remove(0, 1);
        filename.toCharArray(destination, len);
        file.close();
      }
    } else if(strcmp(tag, "size") == 0){
      if(type == tagPlain){
        File file = dir.openFile("r");
        String(file.size()).toCharArray(destination, len);
        file.close();
      }
    } else if(strcmp(tag, "is_mustache") == 0){
      File file = dir.openFile("r");
      String filename = file.name();
      file.close();
      bool test = filename.endsWith(".mustache");

      if(type == tagListItem){
        element_count = list_element[parent_depth];
      } else {
        element_count = (int)test;
        String(test ? "Y":"N").toCharArray(destination, len);
      }
    }
  }

  if(strstr(list_parent, "|servers.mqtt")){
    Host* p_host;
    bool active;
    brokers->GetLastHost(&p_host, active);
    if(strcmp(tag, "service_name") == 0){
      if(type == tagPlain){
        p_host->service_name.toCharArray(destination, len);
      }
    } else if(strcmp(tag, "host_name") == 0){
      if(type == tagPlain){
        p_host->host_name.toCharArray(destination, len);
      }
    } else if(strcmp(tag, "address") == 0){
      if(type == tagPlain){
        ip_to_string(p_host->address).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "port") == 0){
      if(type == tagPlain){
        String(p_host->port).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "service_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->service_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "host_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->host_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "ipv4_valid_until") == 0){
      if(type == tagPlain){
        String(p_host->ipv4_valid_until).toCharArray(destination, len);
      }
    } else if(strcmp(tag, "success_counter") == 0){
      if(type == tagPlain){
        String(p_host->success_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "fail_counter") == 0){
      if(type == tagPlain){
        String(p_host->fail_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "connection_attempts") == 0){
      if(type == tagPlain){
        String(p_host->success_counter + p_host->fail_counter).toCharArray(destination, len);
      } else if(type == tagList){
      } else if(type == tagInverted){
      }
    } else if(strcmp(tag, "active") == 0){
      if(type == tagPlain){
        if(active){
          strncpy(destination, "active", len);
        }
      } else if(type == tagListItem){
        int parent_depth = depthOfParent(list_parent, "|fs.files");
        element_count = list_element[parent_depth];
      } else {
        element_count = (int)active;
        String(active ? "Y":"N").toCharArray(destination, len);
      }
    }
  }
}

void CompileMustache::enterList(char* parents, char* tag){
  strcat(list_parent, "|");
  strcat(list_parent, tag);
}

void CompileMustache::exitList(char* parents){
  char* tmp = strrchr(parents, '|');
  if(tmp){
    *tmp = '\0';
  }
}


char* CompileMustache::findPattern(char* buff, const char* pattern, int line_len)
  const{
  for(int i = 0; i < line_len; i++){
    if(strncmp (buff + i, pattern, strlen(pattern)) == 0){
      return buff +i;
    }
  }
  return NULL;
}
